In [1]:
#pandas 窗口函数rolling 和expand测试
import pandas as pd

In [69]:
df1 = pd.DataFrame([['alex',40,90,83],['tom',65,72,100],['siri',30,68,77],['fara',65,70,70]],
                  columns =['name','English','math','sports'])

In [70]:
df1

   name  English  math  sports
0  alex       40    90      83
1   tom       65    72     100
2  siri       30    68      77
3  fara       65    70      70

In [71]:
English_max = df1.sort_values(by = 'English', ascending = False).head(3)
English_max

   name  English  math  sports
1   tom       65    72     100
3  fara       65    70      70
0  alex       40    90      83

In [86]:
English_max1 =df1['English'].rank(method="min")
English_max1

0    2.0
1    3.0
2    1.0
3    3.0
Name: English, dtype: float64

In [93]:
df1.rolling(2,min_periods=1).agg('sum')

   English   math  sports
0     40.0   90.0    83.0
1    105.0  162.0   183.0
2     95.0  140.0   177.0
3     95.0  138.0   147.0

In [95]:
df1.expanding(min_periods=2).agg('sum')#相当于CUmsum

   English   math  sports
0      NaN    NaN     NaN
1    105.0  162.0   183.0
2    135.0  230.0   260.0
3    200.0  300.0   330.0